Catalogs/гиг_ПредметыРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>гиг_ПредметыРасчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИндексЭлемента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Куратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НаборПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гиг_ПараметрыПредметовРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Трудозатраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРаботСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтапПроизводства</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтапПроизводстваПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеЭтапаПроизводства</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭтапыПроизводства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерЭтапа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСледующегоЭтапа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьЭтапа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмеренияДлительностиЭтапа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаршрутнаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МаршрутныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/гиг_ПредметыРасчета/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СформироватьСписокВыбораЭтаповПроизводства();
	ПеречитатьНаименованияЭтаповПроизводстваДляТрудозатрат();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПеречитатьНаименованияЭтаповПроизводстваДляТрудозатрат();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//проверка этапов производства
	МассивОшибок = гиг_РасчетИзделий.ПроверитьКорректностьЭтаповПроизводства(ТекущийОбъект, Отказ);
	Для Каждого СтрокаОшибки Из МассивОшибок Цикл
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрокаОшибки.СообщениеОбОшибке;
		Сообщение.Поле = "Объект.ЭтапыПроизводства["+СтрокаОшибки.НомерСтроки+"].НомерСледующегоЭтапа";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПеречитатьНаименованияЭтаповПроизводстваДляТрудозатрат();
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыПроизводстваПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	СформироватьСписокВыбораЭтаповПроизводства();
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыПроизводстваПослеУдаления(Элемент)
	СформироватьСписокВыбораЭтаповПроизводства();
КонецПроцедуры

&НаСервере
Процедура СформироватьСписокВыбораЭтаповПроизводства()
	
	Элементы.ТрудозатратыЭтапПроизводства.СписокВыбора.Очистить();
	Для Каждого Этап Из Объект.ЭтапыПроизводства Цикл
		ПредставлениеЭтапа = Строка(Этап.НомерСтроки) + ". " + Этап.Наименование;
		Элементы.ТрудозатратыЭтапПроизводства.СписокВыбора.Добавить(Этап.НомерСтроки, ПредставлениеЭтапа);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПеречитатьНаименованияЭтаповПроизводстваДляТрудозатрат()
	Для Каждого ТекСтрока Из Объект.Трудозатраты Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("НомерСтроки", ТекСтрока.ЭтапПроизводства);
		МассивСтрок = Объект.ЭтапыПроизводства.НайтиСтроки(ПараметрыОтбора);
		Если МассивСтрок.Количество() > 0 Тогда
			ТекСтрока.НаименованиеЭтапаПроизводства = МассивСтрок[0].Наименование;
		Иначе
			ТекСтрока.НаименованиеЭтапаПроизводства = "";
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыПроизводстваПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ЭтапыПроизводства.ТекущиеДанные;
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ЭтапПроизводства", ТекущиеДанные.НомерСтроки);
	
	МассивСтрок = Объект.Трудозатраты.НайтиСтроки(ПараметрыОтбора);
	Если МассивСтрок.Количество() > 0 Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("МассивСтрок", МассивСтрок);
		ДопПараметры.Вставить("ИндексСтрокиКУдалению", ТекущиеДанные.ПолучитьИдентификатор());
		ДопПараметры.Вставить("НомерСтроки", ТекущиеДанные.НомерСтроки);
		Отказ = Истина;
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПередУдалениемЭтапа", ЭтотОбъект, ДопПараметры);
		ПоказатьВопрос(Оповещение, 
			"При удалении этапа будет очищено поле ""Этап производства"" во всех строках таб. части ""Трудозатраты"" (количество строк "+МассивСтрок.Количество()+"). Продолжить?", Режим, 0);
	Иначе
		Для Каждого ТекСтрока Из Объект.Трудозатраты Цикл
			Если ТекСтрока.ЭтапПроизводства > ТекущиеДанные.НомерСтроки Тогда
				ТекСтрока.ЭтапПроизводства = ТекСтрока.ЭтапПроизводства - 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаПередУдалениемЭтапа(Результат, ДопПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	Для Каждого ТекСтрока Из ДопПараметры.МассивСтрок Цикл
		ТекСтрока.ЭтапПроизводства = 0;
	КонецЦикла;
	
	Объект.ЭтапыПроизводства.Удалить(ДопПараметры.ИндексСтрокиКУдалению);
	
	Для Каждого ТекСтрока Из Объект.Трудозатраты Цикл
		Если ТекСтрока.ЭтапПроизводства > ДопПараметры.НомерСтроки Тогда
			ТекСтрока.ЭтапПроизводства = ТекСтрока.ЭтапПроизводства - 1;
		КонецЕсли;
	КонецЦикла;
	
	Модифицированность = Истина;
	
	СформироватьСписокВыбораЭтаповПроизводства();
	ПеречитатьНаименованияЭтаповПроизводстваДляТрудозатрат();
КонецПроцедуры

&НаКлиенте
Процедура ТрудозатратыЭтапПроизводстваПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Трудозатраты.ТекущиеДанные;
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("НомерСтроки", ТекущиеДанные.ЭтапПроизводства);
	МассивСтрок = Объект.ЭтапыПроизводства.НайтиСтроки(ПараметрыОтбора);
	Если МассивСтрок.Количество() > 0 Тогда
		ТекущиеДанные.НаименованиеЭтапаПроизводства = МассивСтрок[0].Наименование;
	Иначе
		ТекущиеДанные.НаименованиеЭтапаПроизводства = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыПроизводстваНаименованиеПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ЭтапыПроизводства.ТекущиеДанные;
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ЭтапПроизводства", ТекущиеДанные.НомерСтроки);
	МассивСтрок = Объект.Трудозатраты.НайтиСтроки(ПараметрыОтбора);
	Для Каждого СтрокаТрудозатрат Из МассивСтрок Цикл
		СтрокаТрудозатрат.НаименованиеЭтапаПроизводства = ТекущиеДанные.Наименование;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТрудозатратыВидРаботПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Трудозатраты.ТекущиеДанные;
	ТекущиеДанные.Цена = ПолучитьРасценкуРаботыСотрудниковНаСервере(ТекущиеДанные.ВидРабот, ТекущаяДата());
	РасчитатьСуммуСтрокиТрудозатратПриИзменении(ТекущиеДанные);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРасценкуРаботыСотрудниковНаСервере(Знач ВидРабот, Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасценкиРаботСотрудниковСрезПоследних.Расценка КАК Расценка
	|ИЗ
	|	РегистрСведений.РасценкиРаботСотрудников.СрезПоследних(&Дата, ВидРабот = &ВидРабот) КАК РасценкиРаботСотрудниковСрезПоследних";
	Запрос.УстановитьПараметр("ВидРабот", ВидРабот);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Расценка;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

&НаКлиенте
Процедура РасчитатьСуммуСтрокиТрудозатратПриИзменении(ТекущаяСтрока)
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;	
КонецПроцедуры

&НаКлиенте
Процедура ТрудозатратыКоличествоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Трудозатраты.ТекущиеДанные;
	РасчитатьСуммуСтрокиТрудозатратПриИзменении(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТрудозатратыЦенаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Трудозатраты.ТекущиеДанные;
	РасчитатьСуммуСтрокиТрудозатратПриИзменении(ТекущиеДанные);
КонецПроцедуры
